holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
/*
  Serial Information Command - Written By Benjamin Jack Cullen
*/

#include "serial_infocmd.h"
#include <Arduino.h>
#include "matrix.h"
#include "wtgps300p.h"
#include "wt901.h"
#include "multiplexers.h"
#include "custommapping.h"
#include "sidereal_helper.h"
#include "satio.h"
#include "ins.h"
#include "meteors.h"
#include "hextodig.h"
#include "esp32_helper.h"
#include "sdmmc_helper.h"
#include "arg_parser.h"
#include "system_data.h"
#include <FS.h>
#include "SD_MMC.h"
#include "SPIFFS.h"
#include <stdlib.h>
#include "satio_file.h"
#include <limits.h>
#include <float.h>
#include "matrix.h"

bool debug_bool=true;
void debug(String debug_str) {if (debug_bool==true) {Serial.println(debug_str);}}

ArgParser parser;
PlainArgParser plainparser;

struct Serial0Struct serial0Data = {
  .nbytes=0, // number of bytes read by serial.
  .iter_token=0, // count token iterations.
  .BUFFER={}, // serial buffer.
  .token=0, // token pointer.
  .checksum=0,
  .checksum_of_buffer=0,
  .checksum_in_buffer=0,
  .gotSum=0,
  .i_XOR=0,
  .XOR=0,
  .c_XOR=0,
};

int getCheckSumSerial0(char * string) {
  for (serial0Data.XOR=0, serial0Data.i_XOR=0; serial0Data.i_XOR < strlen(string); serial0Data.i_XOR++) {
    serial0Data.c_XOR=(unsigned char)string[serial0Data.i_XOR];
    if (serial0Data.c_XOR=='*') break;
    if (serial0Data.c_XOR != '$') serial0Data.XOR ^= serial0Data.c_XOR;
  }
  return serial0Data.XOR;
}

bool validateChecksumSerial0(char * buffer) {
  memset(serial0Data.gotSum, 0, sizeof(serial0Data.gotSum));
  serial0Data.gotSum[0]=buffer[strlen(buffer) - 3];
  serial0Data.gotSum[1]=buffer[strlen(buffer) - 2];
  serial0Data.checksum_of_buffer= getCheckSumSerial0(buffer);
  serial0Data.checksum_in_buffer=h2d2(serial0Data.gotSum[0], serial0Data.gotSum[1]);
  if (serial0Data.checksum_in_buffer==serial0Data.checksum_of_buffer) {return true;}
  return false;
}

void createChecksumSerial0(char * buffer) {
  serial0Data.checksum_of_buffer=getCheckSumSerial0(buffer);
  sprintf(serial0Data.checksum,"%X",serial0Data.checksum_of_buffer);
}

bool val_global_element_size(const char * data) {
  if (sizeof(data)>=MAX_GLOBAL_ELEMENT_SIZE) {return false;}
  return true;
}

bool val_switch_index(const char * data) {
  if (str_is_int8(data)) {if (atol(data)<MAX_MATRIX_SWITCHES) {return true;}}
  return false;
}

bool val_function_index(const char * data) {
  if (str_is_int8(data)) {if (atol(data)<MAX_MATRIX_SWITCH_FUNCTIONS) {return true;}}
  return false;
}

bool val_speed_units(const char * data) {
  if (str_is_int8(data)) {if (atol(data)<MAX_SPEED_UNIT_MODES) {return true;}}
  return false;
}

bool val_function_name_index(const char * data) {
  if (val_global_element_size(data)==false) {return false;}
  if (str_is_long(data)!=true) {return false;}
  if (atol(data) < MAX_MATRIX_FUNCTION_NAMES) {return true;}
  return false;
}

bool val_function_xyz(const char * data) {
  if (str_is_double(data)) {return true;}
  return false;
}

bool val_function_operator(const char * data) {
  if (str_is_int8(data)) {return true;}
  return false;
}

bool val_switch_port(const char * data) {
  if (str_is_int8(data)) {return true;}
  return false;
}

bool val_mappable_value_index(const char * data) {
  Serial.println(data);
  if (str_is_int8(data)!=true) {return false;}
  if (atoi(data)<MAX_MAPPABLE_VALUES) {return true;} 
  return false;
}

bool val_map_slot_index(const char * data) {
  Serial.println(data);
  if (str_is_int8(data)!=true) {return false;}
  if (atoi(data)<MAX_MAP_SLOTS) {return true;} 
  return false;
}

bool val_ins_mode(const char * data) {
  if (str_is_int8(data)) {if (atol(data)<MAX_INS_MODE) {return true;}}
  return false;
}

bool val_ins_gps_precision(const char * data) {
  if (str_is_float(data)) {return true;}
  return false;
}

bool val_ins_minimum_speed(const char * data) {
  if (str_is_float(data)) {return true;}
  return false;
}

bool val_ins_heading_range_diff(const char * data) {
  if (str_is_float(data)) {return true;}
  return false;
}

static void PrintHelp(void) {
  Serial.println(
  R"(
  [ System ]

      system --save
      system --load
      system --restore-defaults

  [ Matrix ]

      matrix --new                Clears matrix in memory.
      matrix --save n             Specify file slot.
      matrix --load n             Specify file slot.
      matrix --delete n           Specify file slot.
      matrix --startup-enable
      matrix --startup-disable
      matrix -s n                 Specify switch index n.
      matrix -f n                 Specify function index n.
      matrix -p n                 Set port for switch -s.
      matrix -fn n                Set function -f for switch -s. See available matrix functions.
                                  [0] NONE
                                  [1] ON
                                  [2] SWITCHLINK
                                  [3] LOCALTIME
                                  [4] WEEKDAY
                                  [5] DATEDAYX
                                  [6] DATEMONTHX
                                  [7] DATEYEARX
                                  [8] DEGLAT
                                  [9] DEGLON
                                  [10] INSLAT
                                  [11] INSLON
                                  [12] INSHEADING
                                  [13] INSALTITUDE
                                  [14] POSSTATUSGNGGA
                                  [15] SATCOUNT
                                  [16] GPSPRECISION
                                  [17] ALTGNGGA
                                  [18] GSPEEDGNRMC
                                  [19] HEADINGGNRMC
                                  [20] LFLAGGPATT
                                  [21] SFLAGGPATT
                                  [22] RSFLAGGPATT
                                  [23] INSGPATT
                                  [24] SPEEDNUMGPATT
                                  [25] MILEAGEGPATT
                                  [26] GSTDATAGPATT
                                  [27] YAWGPATT
                                  [28] ROLLGPATT
                                  [29] PITCHGPATT
                                  [30] GNGGAVALIDCS
                                  [31] GNRMCVALIDCS
                                  [32] GPATTVALIDCS
                                  [33] GNGGAVALIDCD
                                  [34] GNRMCVALIDCD
                                  [35] GPATTVALIDCD
                                  [36] GYRO0ACCX
                                  [37] GYRO0ACCY
                                  [38] GYRO0ACCZ
                                  [39] GYRO0ANGX
                                  [40] GYRO0ANGY
                                  [41] GYRO0ANGZ
                                  [42] GYRO0MAGX
                                  [43] GYRO0MAGY
                                  [44] GYRO0MAGZ
                                  [45] GYRO0GYROX
                                  [46] GYRO0GYROY
                                  [47] GYRO0GYROZ
                                  [48] METEORS
                                  [49] SUNAZ
                                  [50] SUNALT
                                  [51] MOONAZ
                                  [52] MOONALT
                                  [53] MOONPHASE
                                  [54] MERCURYAZ
                                  [55] MERCURYALT
                                  [56] VENUSAZ
                                  [57] VENUSALT
                                  [58] MARSAZ
                                  [59] MARSALT
                                  [60] JUPITERAZ
                                  [61] JUPITERALT
                                  [62] SATURNAZ
                                  [63] SATURNALT
                                  [64] URANUSAZ
                                  [65] URANUSALT
                                  [66] NEPTUNEAZ
                                  [67] NEPTUNEALT
                                  [68] HEMIGNGGANORTH
                                  [69] HEMIGNGGASOUTH
                                  [70] HEMIGNGGAEAST
                                  [71] HEMIGNGGAWEST
                                  [72] POSSTATUSGNRMCA
                                  [73] POSSTATUSGNRMCV
                                  [74] MODEGNRMCA
                                  [75] MODEGNRMCD
                                  [76] MODEGNRMCE
                                  [77] MODEGNRMCN
                                  [78] HEMIGNRMCNORTH
                                  [79] HEMIGNRMCSOUTH
                                  [80] HEMIGNRMCEAST
                                  [81] HEMIGNRMCWEST
                                  [82] ADMPLEX0
                                  [83] MAPPEDVALUE
                                  [84] SDCARDINSERTED
                                  [85] SDCARDMOUNTED
                                  [86] PCINPUTVALUE
      matrix -fx n                Set function -f value x for switch -s.
      matrix -fy n                Set function -f value y for switch -s.
      matrix -fz n                Set function -f value z for switch -s.
      matrix -fi n                Set function -f logic inverted for switch -s.
      matrix -fo n                Set function -f operator for switch -s.
                                  [0] None
                                  [1] Equal
                                  [2] Over
                                  [3] Under
                                  [4] Range
      matrix --pwm0 n             Set switch -s uS time off period (0uS = remain on)
      matrix --pwm1 n             Set switch -s uS time on period  (0uS = remain off after on)
      matrix --flux n             Set switch -s output fluctuation threshold.
      matrix --oride n            Override switch -s output values.
      matrix --computer-assist n  Enable/disable computer assist for switch -s.
      matrix --omode n            Set switch -s output mode: (0 : matrix logic) (1 : mapped value analog/digital).
      matrix --map-slot n         Set switch -s output as map slot n value.

      example set matrix logic 0 function 0 to detect sdcard mounted:
      matrix -s 0 -f 0 -p 33 -fn 85 -fx 1 -fo 1 --pwm0 1000000 --pwm1 15000 --computer-assist 1
      matrix -s 0 --omode 0

  [ Mapping ]

      map --new      Clears all mapping in memory.
      map --save
      map --load
      map --delete
      map -s n       Specify map slot n.
      map -m n       Specify slot -s mode. (0 : map min to max) (1 : center map x0) (2 : center map x1)
      map -c0 n      Configuration map slot -s value to map. See available map values.
                     [0] Digital
                     [1] YawGPATT
                     [2] RollGPATT
                     [3] PitchGPATT
                     [4] Gyro0AccX
                     [5] Gyro0AccY
                     [6] Gyro0AccZ
                     [7] Gyro0AngX
                     [8] Gyro0AngY
                     [9] Gyro0AngZ
                     [10] Gyro0MagX
                     [11] Gyro0MagY
                     [12] Gyro0MagZ
                     [13] Gyro0GyroX
                     [14] Gyro0GyroY
                     [15] Gyro0GyroZ
                     [16] ADMPlex0_0
                     [17] ADMPlex0_1
                     [18] ADMPlex0_2
                     [19] ADMPlex0_3
                     [20] ADMPlex0_4
                     [21] ADMPlex0_5
                     [22] ADMPlex0_6
                     [23] ADMPlex0_7
                     [24] ADMPlex0_8
                     [25] ADMPlex0_9
                     [26] ADMPlex0_10
                     [27] ADMPlex0_11
                     [28] ADMPlex0_12
                     [29] ADMPlex0_13
                     [30] ADMPlex0_14
                     [31] ADMPlex0_15
      map -c1 n      Configuration map slot -s. (mode 0 : in_min)  (mode 1 : approximate center value)
      map -c2 n      Configuration map slot -s. (mode 0 : in_max)  (mode 1 : Neg_range : 0 to approximate center value)
      map -c3 n      Configuration map slot -s. (mode 0 : out_min) (mode 1 : Pos_range : ADC max - neg range)
      map -c4 n      Configuration map slot -s. (mode 0 : out_max) (mode 1 : out_max)
      map -c5 n      Configuration map slot -s. (mode 1 only : DEADZONE : expected flutuation at center)

      example map analog stick axis x0 on admplex0 channel 0 into map slot 0:
      map -s 0 -m 1 -c0 16 -c1 1974 -c2 1974 -c3 1894 -c4 255 -c5 50
      matrix -s 0 --map-slot 0
      Optional: matrix -s 0 --omode 1

      example map analog stick axis x1 on admplex0 channel 1 into map slot 1:
      map -s 1 -m 2 -c0 17 -c1 1974 -c2 1974 -c3 1894 -c4 255 -c5 50
      matrix -s 1 --map-slot 1
      Optional: matrix -s 1 --omode 1

  [ INS ]

      ins -m n              Set INS mode n. (0 : Off) (1 : Dynamic, set by gps every 100ms) (2 : Fixed, remains on after conditions met).
      ins -gyro n           INS uses gyro for attitude. (0 : gyro heading) (1 : gps heading).
      ins -p n              Set INS minmum required gps precision factor to initialize (higher requires less gps precision).
      ins -s n              Set INS minmum required speed to initialize (lower requires less speed).
      ins -r n              Set INS minmum required range difference difference between gps heading and gyro heading (higher allows more difference).
      ins --reset-forced    Reset INS remains on after conditions met.

  [ Satio ]

