holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
      satio --coord-mode-gps           Use GPS latitude, longitude values.
      satio --coord-mode-static        Do not update latiude, longitude unless --set-coord or otherwise.
      satio --set-coord -lat n -lon n  Set degrees latitude and longitude (ensure --coord-mode-static before --set-coord).
      satio --utc-offset n             Set +-seconds offset time.
      satio --auto-datetime-on         Enable set datetime automatically  (--auto-datetime-on overrides any datetime -set).
      satio --auto-datetime-off        Disable set datetime automatically (ensure --auto-datetime-off before using -set time).
      satio --set-datetime --year n --month n --mday n --hour n --minute n --second n  (must be UTC except if utc offset 0).

      satio --speed-mode-gps     Use GPS speed values.
      satio --speed-mode-static  Do not update speed unless --set-speed or otherwise.
      satio --set-speed n        Set speed in meters per second (ensure --speed-mode-static before --set-speed).satio --set-speed 0.1
      satio --speed-unit-KTS     Use default knots.
      satio --speed-unit-KPH     Convert knots per second to K/PH.
      satio --speed-unit-MPH     Convert knots per second to M/PH.
      satio --speed-unit-mPS     Convert knots per second to meters per second.

      satio --altitude-mode-gps         Use GPS altitude values.
      satio --altitude-mode-static      Do not update speed unless --set-altitude or otherwise.
      satio --set-altitude n            Set altitude in meters (ensure --altitude-mode-static before --set-altitude).
      satio --altitude-unit-meters      Use default meters altitude.
      satio --altitude-unit-kilometers  Convert meters to kilometers.
      satio --altitude-unit-miles       Convert meters to miles.
      
      satio --ground-heading-mode-gps     Use GPS ground heading values.
      satio --ground-heading-mode-static  Do not update heading unless --set-ground-heading or otherwise.
      satio --set-ground-heading          Set ground heading in degrees (0-360. Ensure --ground-heading-mode-static before --ground-heading).

  [ Gyro ]

      gyro --calacc        Callibrate the accelerometer.
      gyro --calmag-start  Begin calibrating the magnetometer.
      gyro --calmag-end    End calibrating the magnetometer.

  [ SDCard ]

      sdcard --mount
      sdcard --unmount

  [ StarNav ]

      starnav RA_HOUR RA_MIN RA_SEC DEC_D DEC_M DEC_S
    
      example: starnav 6 45 8.9 -16 42 58.0

  [ Stat ]

      stat -e     Enable print.
      stat -d     Disable print.
      stat -t     Enables/disables serial print stats and counters. Takes arguments -e, -d.
      stat --partition-table      Print partition table.
      stat --memory-ram           Print ram information.
      stat --sdcard               Print SDCard information.
      stat --system               Print system configuration.
      stat --matrix n             Print matrix switch n configuration.
      stat --matrix -A            Print configuration of all matrix switches.
      stat --map n                Print map slot n data.
      stat --map -A               Print all map slot data.
      stat --sentence -A          Print all sentences. Takes arguments -e, -d.
      stat --sentence --satio     Takes arguments -e, -d.
      stat --sentence --ins       Takes arguments -e, -d.
      stat --sentence --gngga     Takes arguments -e, -d.
      stat --sentence --gnrmc     Takes arguments -e, -d.
      stat --sentence --gpatt     Takes arguments -e, -d.
      stat --sentence --matrix    Takes arguments -e, -d.
      stat --sentence --pcinput   Takes arguments -e, -d.
      stat --sentence --admplex0  Takes arguments -e, -d.
      stat --sentence --gyro0     Takes arguments -e, -d.
      stat --sentence --sun       Takes arguments -e, -d.
      stat --sentence --moon      Takes arguments -e, -d.
      stat --sentence --mercury   Takes arguments -e, -d.
      stat --sentence --venus     Takes arguments -e, -d.
      stat --sentence --mars      Takes arguments -e, -d.
      stat --sentence --jupiter   Takes arguments -e, -d.
      stat --sentence --saturn    Takes arguments -e, -d.
      stat --sentence --uranus    Takes arguments -e, -d.
      stat --sentence --neptune   Takes arguments -e, -d.
      stat --sentence --meteors   Takes arguments -e, -d.

  [ Other ]

      -v    Enable verbosoity.
      -vv   Enable extra verbosoity.
      help
  )"
  );
}

void PrintSystemData(void) {
    Serial.println("-----------------------------------------------------");
    Serial.println("[System] ");
    Serial.println("[serial_command] " + String(systemData.serial_command));
    Serial.println("[output_satio_all] " + String(systemData.output_satio_all));
    Serial.println("[output_satio_enabled] " + String(systemData.output_satio_enabled));
    Serial.println("[output_ins_enabled] " + String(systemData.output_ins_enabled));
    Serial.println("[output_gngga_enabled] " + String(systemData.output_gngga_enabled));
    Serial.println("[output_gnrmc_enabled] " + String(systemData.output_gnrmc_enabled));
    Serial.println("[output_gpatt_enabled] " + String(systemData.output_gpatt_enabled));
    Serial.println("[output_matrix_enabled] " + String(systemData.output_matrix_enabled));
    Serial.println("[output_input_portcontroller] " + String(systemData.output_input_portcontroller));
    Serial.println("[output_admplex0_enabled] " + String(systemData.output_admplex0_enabled));
    Serial.println("[output_gyro_0_enabled] " + String(systemData.output_gyro_0_enabled));
    Serial.println("[output_sun_enabled] " + String(systemData.output_sun_enabled));
    Serial.println("[output_moon_enabled] " + String(systemData.output_moon_enabled));
    Serial.println("[output_mercury_enabled] " + String(systemData.output_mercury_enabled));
    Serial.println("[output_venus_enabled] " + String(systemData.output_venus_enabled));
    Serial.println("[output_mars_enabled] " + String(systemData.output_mars_enabled));
    Serial.println("[output_jupiter_enabled] " + String(systemData.output_jupiter_enabled));
    Serial.println("[output_saturn_enabled] " + String(systemData.output_saturn_enabled));
    Serial.println("[output_uranus_enabled] " + String(systemData.output_uranus_enabled));
    Serial.println("[output_neptune_enabled] " + String(systemData.output_neptune_enabled));
    Serial.println("[output_meteors_enabled] " + String(systemData.output_meteors_enabled));
    Serial.println("-----------------------------------------------------");
}

