holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
void PrintSatIOData(void) {
    Serial.println("-----------------------------------------------------");
    Serial.println("[SatIO] ");
    Serial.println("[coordinate_conversion_mode] " +
      String(satioData.char_coordinate_conversion_mode[satioData.coordinate_conversion_mode]));
    Serial.println("[char_speed_unit_mode] " +
      String(satioData.char_speed_unit_mode[satioData.speed_unit_mode]));
    Serial.println("[utc_second_offset] " + String(satioData.utc_second_offset));
    Serial.println("[utc_auto_offset_flag] " + String(satioData.utc_auto_offset_flag));
    Serial.println("[set_time_automatically] " + String(satioData.set_time_automatically));
    Serial.println("-----------------------------------------------------");
}

void PrintMappingNData(int map_slot) {
  if (map_slot>=0 && map_slot<MAX_MAP_SLOTS) {
    Serial.println("-----------------------------------------------------");
    Serial.println("[slot] " + String(map_slot));
    Serial.println("[map_mode] " + String(mappingData.map_mode[0][map_slot]));
    Serial.println("[map slot idx] " + String(mappingData.index_mapped_value[0][map_slot]));
    Serial.println("[map config 0] " + String(mappingData.mapping_config[0][map_slot][0]));
    Serial.println("[map config 1] " + String(mappingData.mapping_config[0][map_slot][1]));
    Serial.println("[map config 2] " + String(mappingData.mapping_config[0][map_slot][2]));
    Serial.println("[map config 3] " + String(mappingData.mapping_config[0][map_slot][3]));
    Serial.println("[map config 4] " + String(mappingData.mapping_config[0][map_slot][4]));
    Serial.println("[map config 5] " + String(mappingData.mapping_config[0][map_slot][5]));
    Serial.println("-----------------------------------------------------");
  }
}

void PrintMappingData(void) {
  for (int Mi=0; Mi<MAX_MAP_SLOTS; Mi++) {PrintMappingNData(Mi);}
}

void PrintMatrixNData(int matrix_index) {
  if (matrix_index>=0 && matrix_index<MAX_MATRIX_SWITCHES) {
    Serial.println("-----------------------------------------------------");
    Serial.println("[matrix switch] " + String(matrix_index));
    Serial.println("[computer assist] " + String(matrixData.computer_assist[0][matrix_index]));
    Serial.println("[output mode] " + String(matrixData.output_mode[0][matrix_index]));
    Serial.println("[flux] " + String(matrixData.flux_value[0][matrix_index]));
    Serial.println("[pwm] 0: " + String(matrixData.output_pwm[0][matrix_index][0]) + " 1: " +
      String(matrixData.output_pwm[0][matrix_index][1]));
    Serial.println("[port] " + String(matrixData.matrix_port_map[0][matrix_index]));
    Serial.println("[active] " + String(matrixData.switch_intention[0][matrix_index]));
    Serial.println("-----------------------------------------------------");
    for (int Fi=0; Fi<MAX_MATRIX_SWITCH_FUNCTIONS; Fi++) {
      //                                         matrixData.matrix_function[0][switch_idx][func_idx]
      Serial.println("[function " + String(Fi) + " name] " +
        String(matrixData.matrix_function_names[ matrixData.matrix_function[0][matrix_index][Fi] ]));
      Serial.println("[function " + String(Fi) + " matrix_function_operator_name] " +
        String(matrixData.matrix_switch_operator_index[0][matrix_index][Fi]));
      Serial.println("[function " + String(Fi) + " inverted] " +
        String(matrixData.matrix_switch_inverted_logic[0][matrix_index][Fi]));
      Serial.println("[function " + String(Fi) + " x] " +
        String(matrixData.matrix_function_xyz[0][matrix_index][Fi][INDEX_MATRIX_FUNTION_X]));
      Serial.println("[function " + String(Fi) + " y] " +
        String(matrixData.matrix_function_xyz[0][matrix_index][Fi][INDEX_MATRIX_FUNTION_Y]));
      Serial.println("[function " + String(Fi) + " z] " +
        String(matrixData.matrix_function_xyz[0][matrix_index][Fi][INDEX_MATRIX_FUNTION_Z]));
      Serial.println("-----------------------------------------------------");
    }
  }
}

void PrintMatrixData(void) {
    for (int Mi=0; Mi<MAX_MATRIX_SWITCHES; Mi++) {PrintMatrixNData(Mi);}
}

void PrintSDCardInformation() {
  Serial.println("sdcard inserted:    " + String(sdcardData.sdcard_inserted));
  Serial.println("sdcard mounted:     " + String(sdcardData.sdcard_mounted));
  Serial.println("sdcard mount point: " + String(sdcardData.sdcard_mountpoint));
  Serial.println("sdcard type:        " +
    String(sdcardData.sdcard_type_names[sdcardData.sdcard_type]) +
    " (type: " + String(sdcardData.sdcard_type) + ").");
  Serial.println("sdcard card size:   " + String(sdcardData.sdcard_card_size));
  Serial.println("sdcard total bytes: " + String(sdcardData.sdcard_total_bytes));
  Serial.println("sdcard used bytes:  " + String(sdcardData.sdcard_used_bytes));
  Serial.println("sdcard sector size: " + String(sdcardData.sdcard_sector_size));
}

void setAllSentenceOutput(bool enable) {
  systemData.output_satio_enabled=enable;
  systemData.output_gngga_enabled=enable;
  systemData.output_gnrmc_enabled=enable;
  systemData.output_gpatt_enabled=enable;
  systemData.output_ins_enabled=enable;
  systemData.output_matrix_enabled=enable;
  systemData.output_input_portcontroller=enable;
  systemData.output_admplex0_enabled=enable;
  systemData.output_gyro_0_enabled=enable;
  systemData.output_sun_enabled=enable;
  systemData.output_moon_enabled=enable;
  systemData.output_mercury_enabled=enable;
  systemData.output_venus_enabled=enable;
  systemData.output_mars_enabled=enable;
  systemData.output_jupiter_enabled=enable;
  systemData.output_saturn_enabled=enable;
  systemData.output_uranus_enabled=enable;
  systemData.output_neptune_enabled=enable;
  systemData.output_meteors_enabled=enable;
}

void setMatrixPort(int switch_idx, signed int port_n) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && port_n>=-1 && port_n<MAX_MATRIX_SWITCHES) {
    matrixData.matrix_port_map[0][switch_idx]=port_n;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixFunction(int switch_idx, int func_idx, int func_n) {
  Serial.println("func_n " + String(func_n));
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS &&
      func_n>=0 &&
      func_n<MAX_MATRIX_FUNCTION_NAMES) {
    matrixData.matrix_function[0][switch_idx][func_idx]=func_n;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
  Serial.println("matrix_function " + String(matrixData.matrix_function[0][switch_idx][func_idx]));
}

