holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
void setMatrixX(int switch_idx, int func_idx, double func_x) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES &&
      func_idx>=0 && func_idx<MAX_MATRIX_SWITCH_FUNCTIONS &&
      func_x>=-DBL_MAX &&
      func_x<DBL_MAX) {
    matrixData.matrix_function_xyz[0][switch_idx][func_idx][INDEX_MATRIX_FUNTION_X]=func_x;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixY(int switch_idx, int func_idx, double func_y) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS && func_y>=-DBL_MAX &&
      func_y<DBL_MAX) {
    matrixData.matrix_function_xyz[0][switch_idx][func_idx][INDEX_MATRIX_FUNTION_Y]=func_y;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixZ(int switch_idx, int func_idx, double func_z) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS && func_z>=-DBL_MAX && func_z<DBL_MAX) {
    matrixData.matrix_function_xyz[0][switch_idx][func_idx][INDEX_MATRIX_FUNTION_Z]=func_z;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixInverted(int switch_idx, int func_idx, int func_i) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS && func_i>=0 && func_i<=1) {
    matrixData.matrix_switch_inverted_logic[0][switch_idx][func_idx]=func_i;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixOperator(int switch_idx, int func_idx, int func_o) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && func_idx>=0 &&
      func_idx<MAX_MATRIX_SWITCH_FUNCTIONS && func_o>=0 && func_o<MAX_MATRIX_OPERATORS) {
    matrixData.matrix_switch_operator_index[0][switch_idx][func_idx]=func_o;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setMatrixModulation(int switch_idx, uint32_t pwm0, uint32_t pwm1) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && pwm0>=0 &&
      pwm0<UINT32_MAX && pwm1>=0 && pwm1<UINT32_MAX) {
    matrixData.output_pwm[0][switch_idx][0]=pwm0;
    matrixData.output_pwm[0][switch_idx][1]=pwm1;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setFlux(int switch_idx, uint32_t flux) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES &&
      flux>=0 && flux<LONG_MAX) {
    matrixData.flux_value[0][switch_idx]=flux;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setOutputMode(int switch_idx, int output_mode) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES &&
      output_mode>=0 && output_mode<MAX_MATRIX_OUTPUT_MODES) {
    matrixData.output_mode[0][switch_idx]=output_mode;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

void setOverrideOutputValue(int switch_idx, uint32_t override_value) {
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES &&
      override_value>=LONG_MIN && override_value<LONG_MAX) {
    matrixData.computer_assist[0][switch_idx]=false;
    matrixData.override_output_value[0][switch_idx]=override_value;
    long i_retry;
    while (matrixData.computer_assist[0][switch_idx]!=false) {
      matrixData.computer_assist[0][switch_idx]=false;
      i_retry++;
      if (i_retry==MAX_MATRIX_OVERRIDE_TIME)
        {Serial.println("WARNING! Could not override computer_assist!"); break;}
      delayMicroseconds(1);
    }
    i_retry=0;
    while (matrixData.override_output_value[0][switch_idx]!=override_value) {
      matrixData.override_output_value[0][switch_idx]=override_value;
      i_retry++;
      if (i_retry==MAX_MATRIX_OVERRIDE_TIME)
        {Serial.println("WARNING! Could not override override_output_value!"); break;}
      delayMicroseconds(1);
    }
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
}

char *cmd_proc_xyzptr;

void setComputerAssist(int switch_idx, bool computer_assist) {
  debug("[setComputerAssist] switch_idx:" + String(switch_idx) + "  computer_assist: " + String(computer_assist));
  debug("[setComputerAssist] current computer_assist: " + String(matrixData.computer_assist[0][switch_idx]));
  if (switch_idx>=0 && switch_idx<MAX_MATRIX_SWITCHES && computer_assist>=0 && computer_assist<=1) {
    matrixData.computer_assist[0][switch_idx]=computer_assist;
    matrixData.matrix_switch_write_required[0][switch_idx]=true;
  }
  else {debug("[setComputerAssist] failed to change computer assist!");}
  debug("[setComputerAssist] computer_assist: " + String(matrixData.computer_assist[0][switch_idx]));
}

void setINSMode(int ins_mode) {
  if (ins_mode>=0 && ins_mode <MAX_INS_MODE)
    {insData.INS_MODE=ins_mode;}
}

void setINSUseGyroHeading(int use_gyro_heading) {
  if (use_gyro_heading>=0 && use_gyro_heading<=1)
    {insData.INS_USE_GYRO_HEADING=use_gyro_heading;}
}

void setINSGPSPrecision(double ins_precision) {
  if (ins_precision>=0 && ins_precision<DBL_MAX)
    {insData.INS_REQ_GPS_PRECISION=ins_precision;}
}

void setINSMinSpeed(double ins_min_speed) {
  if (ins_min_speed>=0 && ins_min_speed<DBL_MAX)
    {insData.INS_REQ_MIN_SPEED=ins_min_speed;}
}

void setINSHeadingRangeDiff(double ins_range_diff) {
  if (ins_range_diff>=0 && ins_range_diff<DBL_MAX)
    {insData.INS_REQ_HEADING_RANGE_DIFF=ins_range_diff;}
}

void setSpeedUnits(int speed_unit_mode) {
  if (speed_unit_mode>=0 && speed_unit_mode <MAX_SPEED_UNIT_MODES)
    {satioData.speed_unit_mode=speed_unit_mode;}
}

void setUTCSecondOffset(int64_t seconds) {
  if (seconds>=LONG_LONG_MIN && seconds<LONG_LONG_MAX)
    {satioData.utc_second_offset=seconds;}
}

void setMapConfig(int map_slot,
                  int map_mode,
                  signed long c0,
                  signed long c1,
                  signed long c2,
                  signed long c3,
                  signed long c4,
                  signed long c5) {
  if (map_slot>=0 && map_slot<MAX_MAP_SLOTS &&
      map_mode>=0 && map_mode<MAX_MAP_MODES &&
      c0>=INT32_MIN && c0<INT32_MAX &&
      c1>=INT32_MIN && c1<INT32_MAX &&
      c2>=INT32_MIN && c2<INT32_MAX &&
      c3>=LONG_MIN && c3<INT32_MAX &&
      c4>=INT32_MIN && c4<INT32_MAX &&
      c5>=INT32_MIN && c5<INT32_MAX) {
    mappingData.mapping_config[0][map_slot][0]=c0;
    mappingData.mapping_config[0][map_slot][1]=c1;
    mappingData.mapping_config[0][map_slot][2]=c2;
    mappingData.mapping_config[0][map_slot][3]=c3;
    mappingData.mapping_config[0][map_slot][4]=c4;
    mappingData.mapping_config[0][map_slot][5]=c5;
    mappingData.map_mode[0][map_slot]=map_mode;
    matrixData.matrix_switch_write_required[0][map_slot]=true;
  }
}

