holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
void setMapSlot(int matrix_switch,
                int map_slot) {
  // Serial.println("[setMapSlot] matrix_switch:" + String(matrix_switch) + "  map_slot:" + String(map_slot));
  if (matrix_switch>=0 && matrix_switch<MAX_MAP_SLOTS &&
      map_slot>=0 && map_slot<=1) {
    mappingData.index_mapped_value[0][matrix_switch]=map_slot;
    matrixData.matrix_switch_write_required[0][map_slot]=true;
  }
}

void saveMatrix(int matrix_file_slot) {
  if (matrix_file_slot>=0 && matrix_file_slot<MAX_MATRIX_SLOTS) {
    memset(satioFileData.current_matrix_filepath, 0, sizeof(satioFileData.current_matrix_filepath));
    strcpy(satioFileData.current_matrix_filepath, satioFileData.matix_filepaths[matrix_file_slot]);
    sdmmcFlagData.save_matrix=true;
  }
}

void loadMatrix(int matrix_file_slot) {
  if (matrix_file_slot>=0 && matrix_file_slot<MAX_MATRIX_SLOTS) {
    memset(satioFileData.current_matrix_filepath, 0, sizeof(satioFileData.current_matrix_filepath));
    strcpy(satioFileData.current_matrix_filepath, satioFileData.matix_filepaths[matrix_file_slot]);
    sdmmcFlagData.load_matrix=true;
  }
}

void deleteMatrix(int matrix_file_slot) {
  if (matrix_file_slot>=0 && matrix_file_slot<MAX_MATRIX_SLOTS) {
    memset(satioFileData.current_matrix_filepath, 0, sizeof(satioFileData.current_matrix_filepath));
    strcpy(satioFileData.current_matrix_filepath, satioFileData.matix_filepaths[matrix_file_slot]);
    sdmmcFlagData.delete_matrix=true;
  }
}

void datetimeSetRTC(uint16_t year, uint8_t month, uint8_t mday,
                            uint8_t hour, uint8_t min, uint8_t sec) {
  /*
  satio --utc-offset n       Set +-seconds offset time.
  satio --auto-datetime-on   Enable set datetime automatically
  satio --auto-datetime-off  Disable set datetime automatically (-set requires auto off prior to calling set)
  satio --set-datetime --year n --month n --mday n --hour n --minute n --second n  (must be UTC except if utc offset 0)
  satio --set-datetime --year 25 --month 10 --mday 16 --hour 5 --minute 0 --second 0
  */
  if (year>=0  && year <UINT16_MAX &&
      month>=0 && month<UINT8_MAX  &&
      mday>=0  && mday <UINT8_MAX  &&
      hour>=0  && hour <UINT8_MAX  &&
      min>=0   && min  <UINT8_MAX  &&
      sec>=0   && sec  <UINT8_MAX) {
    satioData.tmp_year_int=year;
    satioData.tmp_month_int=month;
    satioData.tmp_day_int=mday;
    satioData.tmp_hour_int=hour;
    satioData.tmp_minute_int=min;
    satioData.tmp_second_int=sec;
    satioData.set_rtc_datetime_flag=true;
  }
}

void datetimeSetDTAuto(bool set_dt_auto) {
  if (set_dt_auto==true) {satioData.sync_rtc_immediately_flag=true; satioData.set_time_automatically=true;}
  else {satioData.set_time_automatically=false;}
}

void setCoordinatesDegrees(double latitude, double longitude) {
  /*
     satio --coord-mode-gps
     satio --coord-mode-static
     satio --set-coord -lat 0.123 -lon 4.567
  */
  if (latitude>=-90 && latitude<=90 && longitude>=-180 && longitude<=180) {
    satioData.degrees_latitude=latitude;
    satioData.degrees_longitude=longitude;
  }
}

void setAltitude(double altitude) {
  /*
     satio --altitude-mode-gps
     satio --altitude-mode-static
     satio --set-altitude 1000
     satio --altitude-unit-kilometers
     satio --altitude-unit-miles
     satio --altitude-unit-meters
  */
  if (altitude>=0 && altitude<DBL_MAX && altitude!=NAN) {
    satioData.altitude=altitude;
  }
}

void setSpeed(double speed) {
  /*
     satio --speed-mode-gps
     satio --speed-mode-static
     satio --set-speed 1000
     satio --speed-unit-KTS
     satio --speed-unit-KPH
     satio --speed-unit-MPH
     satio --speed-unit-mPS
  */
  if (speed>=0 && speed<DBL_MAX && speed!=NAN) {
    satioData.speed=speed;
  }
}

void setGroundHeading(double heading) {
  /*
     satio --ground-heading-mode-static
     satio --ground-heading-mode-gps
     satio --set-ground-heading 180
  */
  if (heading>=0 && heading<DBL_MAX && heading!=NAN) {
    satioData.ground_heading=heading;
  }
}

void star_nav() {
  // star sirius test: starnav 6 45 8.9 -16 42 58.0
  // ngc test:         starnav 2 20 35.0 -23 7 0.0
  // ic test:          starnav 17 46 18 5 43 00
  // other obj test:   starnav 1 36 0 61 17 0
  // messier test:     starnav 16 41 40 36 28 0
  // caldwel test:     starnav 1 19 32.6 58 17 27
  // Herschel test:    starnav 0 29 56.0 60 14 0.0
  // new stars test    starnav 0 02 07.2 -14 40 34
  // caldwel test:     starnav 00 13 0 72 32 0
  simple_argparser_init_from_buffer(&plainparser, serial0Data.BUFFER, 1);
  if ((str_is_int8(plainparser.tokens[0])==true) &&
      (str_is_int8(plainparser.tokens[1])==true) &&
      (str_is_float(plainparser.tokens[2])==true) &&
      (str_is_int8(plainparser.tokens[3])==true) &&
      (str_is_int8(plainparser.tokens[4])==true) &&
      (str_is_float(plainparser.tokens[5])==true)
    )
  {
    Serial.println("attempting to identify object..");
    // this is identify (so first identify object)
    IdentifyObject(
      atoi(plainparser.tokens[0]),
      atoi(plainparser.tokens[1]),
      atof(plainparser.tokens[2]),
      atoi(plainparser.tokens[3]),
      atoi(plainparser.tokens[4]),
      atof(plainparser.tokens[5])
    );
    //
    /*
      Once identified we can track object (requires modified SiderealObjects lib).
    */
    trackObject(satioData.degrees_latitude, satioData.degrees_longitude,
      satioData.rtc_year, satioData.rtc_month, satioData.rtc_mday,
      satioData.rtc_hour, satioData.rtc_minute, satioData.rtc_second,
      satioData.local_hour, satioData.local_minute, satioData.local_second,
      atof(gnggaData.altitude), siderealObjectData.object_table_i, siderealObjectData.object_number);
    Serial.println("---------------------------------------------");
    Serial.println("Table Index:   " + String(siderealObjectData.object_table_i));
    Serial.println("Table:         " + String(siderealObjectData.object_table_name));
    Serial.println("Number:        " + String(siderealObjectData.object_number));
    Serial.println("Name:          " + String(siderealObjectData.object_name));
    Serial.println("Type:          " + String(siderealObjectData.object_type));
    Serial.println("Constellation: " + String(siderealObjectData.object_con));
    Serial.println("Distance:      " + String(siderealObjectData.object_dist));
    Serial.println("Azimuth:       " + String(siderealObjectData.object_az));
    Serial.println("Altitude:      " + String(siderealObjectData.object_alt));
    Serial.println("Rise:          " + String(siderealObjectData.object_r));
    Serial.println("Set:           " + String(siderealObjectData.object_s));
    Serial.println("---------------------------------------------");
  }
  else {Serial.println("identify object: bad input data");}
}

void unmountSDCard() {
  sdmmcFlagData.no_delay_flag=true;
  sdmmcFlagData.unmount_sdcard_flag=true;
}

void mountSDCard() {
  sdmmcFlagData.no_delay_flag=true;
  sdmmcFlagData.mount_sdcard_flag=true;
}

