holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
      else if (strcmp(pos[0], "ins")==0) {
        if (argparser_has_flag(&parser, "m")) {setINSMode(argparser_get_int8(&parser, "m", -1));}
        if (argparser_has_flag(&parser, "gyro")) {setINSUseGyroHeading(argparser_get_int8(&parser, "gyro", -1));}
        if (argparser_has_flag(&parser, "p")) {setINSGPSPrecision(argparser_get_double(&parser, "p", -1));}
        if (argparser_has_flag(&parser, "s")) {setINSMinSpeed(argparser_get_double(&parser, "s", -1));}
        if (argparser_has_flag(&parser, "r")) {setINSHeadingRangeDiff(argparser_get_double(&parser, "r", -1));}
        if (argparser_has_flag(&parser, "reset-forced")) {insData.INS_FORCED_ON_FLAG=false;}
      }

      else if (strcmp(pos[0], "satio")==0) {

        if (argparser_has_flag(&parser, "altitude-mode-static")) {satioData.altitude_conversion_mode=ALTITUDE_CONVERSION_MODE_STATIC;}
        if (argparser_has_flag(&parser, "altitude-mode-gps")) {satioData.altitude_conversion_mode=ALTITUDE_CONVERSION_MODE_GPS;}
        if (argparser_has_flag(&parser, "altitude-unit-meters")) {satioData.altitude_unit_mode=ALTITUDE_UNIT_MODE_METERS;}
        if (argparser_has_flag(&parser, "altitude-unit-miles")) {satioData.altitude_unit_mode=ALTITUDE_UNIT_MODE_MILES;}
        if (argparser_has_flag(&parser, "altitude-unit-kilometers")) {satioData.altitude_unit_mode=ALTITUDE_UNIT_MODE_KILOMETERS;}
        if (argparser_has_flag(&parser, "set-altitude")) {
          setAltitude(argparser_get_double(&parser, "set-altitude", NAN));
        }

        if (argparser_has_flag(&parser, "speed-mode-static")) {satioData.speed_conversion_mode=SPEED_CONVERSION_MODE_STATIC;}
        if (argparser_has_flag(&parser, "speed-mode-gps")) {satioData.speed_conversion_mode=SPEED_CONVERSION_MODE_GPS;}
        if (argparser_has_flag(&parser, "speed-unit-KTS")) {satioData.speed_unit_mode=SPEED_UNIT_MODE_KTS;}
        if (argparser_has_flag(&parser, "speed-unit-MPH")) {satioData.speed_unit_mode=SPEED_UNIT_MODE_MPH;}
        if (argparser_has_flag(&parser, "speed-unit-KPH")) {satioData.speed_unit_mode=SPEED_UNIT_MODE_KPH;}
        if (argparser_has_flag(&parser, "speed-unit-mPS")) {satioData.speed_unit_mode=SPEED_UNIT_MODE_METERS_A_SECOND;}
        if (argparser_has_flag(&parser, "set-speed")) {
          setSpeed(argparser_get_double(&parser, "set-speed", NAN));
        }

        if (argparser_has_flag(&parser, "ground-heading-mode-static")) {satioData.ground_heading_mode=GROUND_HEADING_MODE_STATIC;}
        if (argparser_has_flag(&parser, "ground-heading-mode-gps")) {satioData.ground_heading_mode=GROUND_HEADING_MODE_GPS;}
        if (argparser_has_flag(&parser, "set-ground-heading")) {
          setGroundHeading(argparser_get_double(&parser, "set-ground-heading", NAN));
        }

        if (argparser_has_flag(&parser, "coord-mode-static")) {satioData.coordinate_conversion_mode=COORDINATE_CONVERSION_MODE_STATIC;}
        if (argparser_has_flag(&parser, "coord-mode-gps")) {satioData.coordinate_conversion_mode=COORDINATE_CONVERSION_MODE_GPS;}
        if (argparser_has_flag(&parser, "set-coord")) {
          setCoordinatesDegrees(argparser_get_double(&parser, "lat", NAN),
          argparser_get_double(&parser,  "lon", NAN));
        }

        if (argparser_has_flag(&parser, "utc-offset")) {setUTCSecondOffset(argparser_get_int64(&parser, "utc-offset", 0));}
        if (argparser_has_flag(&parser, "auto-datetime-on")) {datetimeSetDTAuto(true);}
        if (argparser_has_flag(&parser, "auto-datetime-off")) {datetimeSetDTAuto(false);}
        if (argparser_has_flag(&parser, "set-datetime")) {
          datetimeSetRTC(argparser_get_uint16(&parser, "year", -1),
                                 argparser_get_uint8(&parser,  "month", -1),
                                 argparser_get_uint8(&parser,  "mday", -1),
                                 argparser_get_uint8(&parser,  "hour", -1),
                                 argparser_get_uint8(&parser,  "minute", -1),
                                 argparser_get_uint8(&parser,  "second", -1));}
      }

      else if (strcmp(pos[0], "gyro")==0) {
        if (argparser_has_flag(&parser, "calacc")) {WT901CalAcc();}
        if (argparser_has_flag(&parser, "calmag-start")) {WT901CalMagStart();}
        else if (argparser_has_flag(&parser, "calmag-stop")) {WT901CalMagEnd();}
      }

      else if (strcmp(pos[0], "sdcard")==0) {
        if (argparser_has_flag(&parser, "mount")) {mountSDCard();}
        else if (argparser_has_flag(&parser, "unmount")) {unmountSDCard();}
      }
    }
  }
}

// ---------------------------------------------------------------------------------------------------------------
/*
  Serial TXD : Output.
*/
// ---------------------------------------------------------------------------------------------------------------
long i_output_config_matrix = 0;

void outputSentences(void) {
  if (systemData.interval_breach_1_second==true) {outputStat();}

  if (systemData.interval_breach_gps) {
    systemData.interval_breach_gps=0;
    if (systemData.output_gngga_enabled) {Serial.println(gnggaData.outsentence);}
    if (systemData.output_gnrmc_enabled) {Serial.println(gnrmcData.outsentence);}
    if (systemData.output_gpatt_enabled) {Serial.println(gpattData.outsentence);}
    if (systemData.output_satio_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$SATIO,");

      strcat(serial0Data.BUFFER, String(satioData.padded_rtc_time_HHMMSS).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.padded_rtc_date_DDMMYYYY).c_str());
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(satioData.padded_rtc_sync_time_HHMMSS).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.padded_rtc_sync_date_DDMMYYYY).c_str());
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(satioData.padded_local_time_HHMMSS).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.padded_local_date_DDMMYYYY).c_str());
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(systemData.uptime_seconds).c_str());
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(satioData.char_coordinate_conversion_mode[satioData.coordinate_conversion_mode]).c_str()); // static/GPS
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.degrees_latitude, 7).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.degrees_longitude, 7).c_str());
      strcat(serial0Data.BUFFER, ",");

