holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
      strcat(serial0Data.BUFFER, String(satioData.char_altitude_conversion_mode[satioData.altitude_conversion_mode]).c_str()); // static/GPS
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.altitude_converted, 7).c_str()); // value
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.char_altitude_unit_mode[satioData.altitude_unit_mode]).c_str()); // units of measurement
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(satioData.char_speed_conversion_mode[satioData.speed_conversion_mode]).c_str()); // static/GPS
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.speed_converted, 7).c_str()); // value
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.char_speed_unit_mode[satioData.speed_unit_mode]).c_str()); // units of measurement
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(satioData.char_ground_heading_mode[satioData.ground_heading_mode]).c_str()); // static/GPS
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(satioData.ground_heading, 7).c_str()); // value
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(insData.ins_latitude, 7).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.ins_longitude, 7).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.ins_altitude).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.ins_heading).c_str());
      
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.INS_INITIALIZATION_FLAG).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.INS_MODE).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.INS_FORCED_ON_FLAG).c_str());
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(insData.INS_REQ_GPS_PRECISION).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.INS_REQ_HEADING_RANGE_DIFF).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.INS_REQ_MIN_SPEED).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(insData.INS_USE_GYRO_HEADING).c_str());
      strcat(serial0Data.BUFFER, ",");

      strcat(serial0Data.BUFFER, String(insData.INS_ENABLED).c_str());
      strcat(serial0Data.BUFFER, ",");

      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }
  if (systemData.interval_breach_gyro_0) {
    systemData.interval_breach_gyro_0 = 0;
    if (systemData.output_gyro_0_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$GYRO0,");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_acc_x).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_acc_y).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_acc_z).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_ang_x).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_ang_y).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_ang_z).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_gyr_x).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_gyr_y).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_gyr_z).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_mag_x).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_mag_y).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(gyroData.gyro_0_mag_z).c_str());
      strcat(serial0Data.BUFFER, ",");
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }
  if (systemData.interval_breach_track_planets) {
    systemData.interval_breach_track_planets = 0;
    if (systemData.output_sun_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$SUN,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.sun_s + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_moon_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$MOON,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_p + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.moon_lum + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_mercury_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$MERCURY,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mercury_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_venus_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$VENUS,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.venus_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_mars_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$MARS,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.mars_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_jupiter_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$JUPITER,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.jupiter_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_saturn_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$SATURN,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.saturn_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_uranus_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$URANUS,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.uranus_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_neptune_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$NEPTUNE,");
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_ra + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_dec + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_az + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_alt + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_r + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_s + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_helio_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_helio_ecliptic_long + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_radius_vector + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_distance + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_ecliptic_lat + String(",")).c_str());
      strcat(serial0Data.BUFFER, String(siderealPlanetData.neptune_ecliptic_long + String(",")).c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
    if (systemData.output_meteors_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$METEOR,");
      for (int i=0; i<MAX_METEOR_SHOWERS; i++) {
        strcat(serial0Data.BUFFER, String(String(meteor_shower_warning_system[i][0]) + String(",")).c_str());
        strcat(serial0Data.BUFFER, String(String(meteor_shower_warning_system[i][1]) + String(",")).c_str());
      }
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }

  // if (systemData.interval_breach_matrix) {
  // systemData.interval_breach_matrix = 0;
  if (systemData.output_matrix_enabled) {
    memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
    strcpy(serial0Data.BUFFER, "$MATRIX,");
    // append matrix switch state data
    for (int i=0; i < MAX_MATRIX_SWITCHES; i++)
      {strcat(serial0Data.BUFFER, String(String(matrixData.switch_intention[0][i])+",").c_str());}
    for (int i=0; i < MAX_MATRIX_SWITCHES; i++)
      {strcat(serial0Data.BUFFER, String(String(matrixData.computer_intention[0][i])+",").c_str());}
    for (int i=0; i < MAX_MATRIX_SWITCHES; i++)
      {strcat(serial0Data.BUFFER, String(String(matrixData.output_value[0][i])+",").c_str());}
    createChecksumSerial0(serial0Data.BUFFER);
    strcat(serial0Data.BUFFER, "*");
    strcat(serial0Data.BUFFER, serial0Data.checksum);
    Serial.println(serial0Data.BUFFER);
  }

  if (systemData.output_input_portcontroller) {
    memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
    strcpy(serial0Data.BUFFER, "$PCINPT,");
    // append matrix switch state data
    for (int i=0; i < MAX_MATRIX_SWITCHES; i++)
      {strcat(serial0Data.BUFFER, String(String(matrixData.input_value[0][i])+",").c_str());}
    createChecksumSerial0(serial0Data.BUFFER);
    strcat(serial0Data.BUFFER, "*");
    strcat(serial0Data.BUFFER, serial0Data.checksum);
    Serial.println(serial0Data.BUFFER);
  }

