holographicSol/SatIO_ESP32-P4/SatIO/src/serial_infocmd.cpp
  /*
  COMPREHENSIVE MATRIX CONFIGURATION (SENTENCE PER SWITCH)
  */
  if (systemData.output_config_matrix_enabled) {
    // for (int Mi=0; i_output_config_matrix < MAX_MATRIX_SWITCHES; Mi++) { // uncomment to dump all sentences at once
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcpy(serial0Data.BUFFER, "$XMATRIX,");
      strcat(serial0Data.BUFFER, String(String(i_output_config_matrix)+",").c_str());
      for (int Fi=0; Fi < MAX_MATRIX_SWITCH_FUNCTIONS; Fi++) {
        strcat(serial0Data.BUFFER, String(String(matrixData.matrix_function[0][i_output_config_matrix][Fi])+",").c_str());
      }
      for (int Fi=0; Fi < MAX_MATRIX_SWITCH_FUNCTIONS; Fi++) {
        strcat(serial0Data.BUFFER, String(String(matrixData.matrix_switch_operator_index[0][i_output_config_matrix][Fi])+",").c_str());
      }
      for (int Fi=0; Fi < MAX_MATRIX_SWITCH_FUNCTIONS; Fi++) {
        strcat(serial0Data.BUFFER, String(String(matrixData.matrix_switch_inverted_logic[0][i_output_config_matrix][Fi])+",").c_str());
      }
      for (int Fi=0; Fi < MAX_MATRIX_SWITCH_FUNCTIONS; Fi++) {
        strcat(serial0Data.BUFFER, String(String(matrixData.matrix_function_xyz[0][i_output_config_matrix][Fi][INDEX_MATRIX_FUNTION_X])+",").c_str());
      }
      for (int Fi=0; Fi < MAX_MATRIX_SWITCH_FUNCTIONS; Fi++) {
        strcat(serial0Data.BUFFER, String(String(matrixData.matrix_function_xyz[0][i_output_config_matrix][Fi][INDEX_MATRIX_FUNTION_Y])+",").c_str());
      }
      for (int Fi=0; Fi < MAX_MATRIX_SWITCH_FUNCTIONS; Fi++) {
        strcat(serial0Data.BUFFER, String(String(matrixData.matrix_function_xyz[0][i_output_config_matrix][Fi][INDEX_MATRIX_FUNTION_Z])+",").c_str());
      }
      strcat(serial0Data.BUFFER, String(String(matrixData.flux_value[0][i_output_config_matrix])+",").c_str());
      strcat(serial0Data.BUFFER, String(String(matrixData.output_pwm[0][i_output_config_matrix][0])+",").c_str());
      strcat(serial0Data.BUFFER, String(String(matrixData.output_pwm[0][i_output_config_matrix][1])+",").c_str());
      strcat(serial0Data.BUFFER, String(String(matrixData.output_mode[0][i_output_config_matrix])+",").c_str());
      strcat(serial0Data.BUFFER, String(String(mappingData.index_mapped_value[0][i_output_config_matrix])+",").c_str());
      strcat(serial0Data.BUFFER, String(String(matrixData.computer_assist[0][i_output_config_matrix])+",").c_str());
      strcat(serial0Data.BUFFER, String(String(matrixData.matrix_port_map[0][i_output_config_matrix])+",").c_str());
      // strcat(serial0Data.BUFFER, String(String(matrixData.switch_intention[0][i_output_config_matrix])+",").c_str());
      // strcat(serial0Data.BUFFER, String(String(matrixData.computer_intention[0][i_output_config_matrix])+",").c_str());
      // strcat(serial0Data.BUFFER, String(String(matrixData.output_value[0][i_output_config_matrix])+",").c_str());
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
      i_output_config_matrix++;
      if (i_output_config_matrix>=MAX_MATRIX_SWITCHES) {i_output_config_matrix=0;}
    // }
  }
  /*
  COMPREHENSIVE MAPPING CONFIGURATION
  */
  if (systemData.output_config_mapping_enabled) {
    for (int Mi=0; Mi < MAX_MAP_SLOTS; Mi++) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcpy(serial0Data.BUFFER, "$XMAPP,");
      strcat(serial0Data.BUFFER, String(String(Mi)+",").c_str());
      for (int Fi=0; Fi < MAX_MAPPING_PARAMETERS; Fi++) {
        strcat(serial0Data.BUFFER, String(String(mappingData.mapping_config[0][Mi][Fi])+",").c_str());
      }
      strcat(serial0Data.BUFFER, String(String(mappingData.map_mode[0][Mi])+",").c_str());
      strcat(serial0Data.BUFFER, String(String(mappingData.mapped_value[0][Mi])+",").c_str());

      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }

  if (systemData.interval_breach_mplex) {
    systemData.interval_breach_mplex = 0;
    if (systemData.output_admplex0_enabled) {
      memset(serial0Data.BUFFER, 0, sizeof(serial0Data.BUFFER));
      strcat(serial0Data.BUFFER, "$MPLEX0,");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[0]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[1]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[2]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[3]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[4]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[5]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[6]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[7]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[8]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[9]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[10]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[11]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[12]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[13]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[14]).c_str());
      strcat(serial0Data.BUFFER, ",");
      strcat(serial0Data.BUFFER, String(multiplexerData.ADMPLEX_0_DATA[15]).c_str());
      strcat(serial0Data.BUFFER, ",");
      createChecksumSerial0(serial0Data.BUFFER);
      strcat(serial0Data.BUFFER, "*");
      strcat(serial0Data.BUFFER, serial0Data.checksum);
      Serial.println(serial0Data.BUFFER);
    }
  }
}

void printArray(signed long arr[], int start, int end) {
    for (int i = start; i < end; i++) {
        printf("%-7d", arr[i]); // Left-align with 5-character width
    }
    printf("\n");
}

// uncomment to use
signed long print_index_0[35]={0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
                              11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
                              21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
                              32, 33, 34};
signed long print_index_1[35]={35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45,
                               46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56,
                               57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
                               68, 69};
char counter_chars_0[16][56]={"Loops p/s",
                              "GPS p/s",
                              "INS p/s",
                              "Gyro0 p/s",
                              "ADMplex0 p/s",
                              "CMD p/s",
                              "Universe p/s",
                              "Matrix p/s",
                              "I/O p/s",
                              "PConInput p/s",
                              "LT uS",
                              "LT Max uS",
                              "Satellites",
                              "GPS Precision"};
double counter_digits_0[16]={};

char counter_chars_1_row_0[9][56]={"Time",
                                   "Date",
                                   "UNIX Time",
                                   "Latitude",
                                   "Longitude",
                                   "Altitude",
                                   "Heading",
                                   "Speed",
                                   "Mileage"};
char counter_chars_1_col_0[5][56]={"GPS",
                                   "RTC",
                                   "RTC Sync",
                                   "System",
                                   "System INS"};
char counter_digits_1_row_N[9][56]={};

void outputStat(void) {
    // ---------------------------------------------------------------------
    //                                                 EXECUTIONS PER SECOND
    // ---------------------------------------------------------------------
    // note that output will not be suitable at too large a font/zoom
    // ---------------------------------------------------------------------
    // System Stat Overview.
    // column width supports numbers of up to 9,999,999.
    // All matrix xyz digits are rounded to fit column width.
    // Column width is 7 (million+space).
    // Any chars/digits wider than 6 chars will overlap/touch next column.
    // For development & diagnostic purposes.
    // ---------------------------------------------------------------------
    if (systemData.output_stat==true || systemData.output_stat_v==true || systemData.output_stat_vv) {
    // printAllTimes();
    // ----------------------------------------------------------------------------------------------------------------------------
    //                                                                                                               PRINT COUNTERS
    // ----------------------------------------------------------------------------------------------------------------------------
    Serial.println();
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    // printf("taskGyro", "Unused stack: %u words\n", watermark_task_gyro);
    // printf("taskUniverse", "Unused stack: %u words\n", watermark_task_universe);
    // printf("taskSwitches", "Unused stack: %u words\n", watermark_task_switches);
    // printf("taskGPS", "Unused stack: %u words\n", watermark_task_gps);
    // printf("taskMultiplexers", "Unused stack: %u words\n", watermark_task_multiplexers);
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    counter_digits_0[0]=systemData.total_loops_a_second;
    counter_digits_0[1]=systemData.total_gps;
    counter_digits_0[2]=systemData.total_ins;
    counter_digits_0[3]=systemData.total_gyro;
    counter_digits_0[4]=systemData.total_mplex;
    counter_digits_0[5]=systemData.total_infocmd;
    counter_digits_0[6]=systemData.total_universe;
    counter_digits_0[7]=systemData.total_matrix;
    counter_digits_0[8]=systemData.total_portcon;
    counter_digits_0[9]=systemData.total_portcontroller_input;
    counter_digits_0[10]=systemData.mainLoopTimeTaken;
    counter_digits_0[11]=systemData.mainLoopTimeTakenMax;
    counter_digits_0[12]=atoi(gnggaData.satellite_count);
    counter_digits_0[13]=atof(gnggaData.gps_precision_factor);
    for (int i = 0; i < 14; i++) {printf("%-16s", counter_chars_0[i]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    for (int i = 0; i < 14; i++) {printf("%-16f", counter_digits_0[i]);}
    printf("\n");
    Serial.println();
    // ----------------------------------------------------------------------------------------------------------------------------
    //                                                                                                           PRINT PRIMARY DATA
    // ----------------------------------------------------------------------------------------------------------------------------
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
    Serial.print("                   ");
    for (int i = 0; i < 9; i++) {printf("%-19s", counter_chars_1_row_0[i]);}
    printf("\n");
    Serial.println("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------");

    memset(counter_digits_1_row_N[0], 0, sizeof(counter_digits_1_row_N[0])); strcpy(counter_digits_1_row_N[0], String(gnrmcData.utc_time).c_str());
    memset(counter_digits_1_row_N[1], 0, sizeof(counter_digits_1_row_N[1])); strcpy(counter_digits_1_row_N[1], String(gnrmcData.utc_date).c_str());
    memset(counter_digits_1_row_N[2], 0, sizeof(counter_digits_1_row_N[2])); // null
    memset(counter_digits_1_row_N[3], 0, sizeof(counter_digits_1_row_N[3])); strcpy(counter_digits_1_row_N[3], String(gnrmcData.latitude).c_str());
    memset(counter_digits_1_row_N[4], 0, sizeof(counter_digits_1_row_N[4])); strcpy(counter_digits_1_row_N[4], String(gnrmcData.longitude).c_str());
    memset(counter_digits_1_row_N[5], 0, sizeof(counter_digits_1_row_N[5])); strcpy(counter_digits_1_row_N[5], String(gnggaData.altitude, 7).c_str());
    memset(counter_digits_1_row_N[6], 0, sizeof(counter_digits_1_row_N[6])); strcpy(counter_digits_1_row_N[6], String(gnrmcData.ground_heading, 7).c_str());
    memset(counter_digits_1_row_N[7], 0, sizeof(counter_digits_1_row_N[7])); strcpy(counter_digits_1_row_N[7], String(gnrmcData.ground_speed, 7).c_str());
    memset(counter_digits_1_row_N[8], 0, sizeof(counter_digits_1_row_N[8])); strcpy(counter_digits_1_row_N[8], String(gpattData.mileage, 7).c_str());
    for (int i = 0; i < 10; i++) {if (i==0) {printf("%-19s", counter_chars_1_col_0[i]);} else {printf("%-19s", counter_digits_1_row_N[i-1]);}}
    printf("\n");
    
